#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <stdlib.h>
//
//int main()
//{
//	//int a = 10;
//	//int b = a<<1;
//	//<<- 左移操作符-二进制位
//	//左边丢弃，右边补0
//	//00000000000000000000000000001010
//	int a = -1;
//	int b = a<<1;
//	//整数在内存中存储的时候
//	//存储的是二进制的补码
//	//正数的原、返、补码是相同的
//	//原码
//	//10000000000000000000000000000001
//	//反码
//	//11111111111111111111111111111110
//	//补码
//	//11111111111111111111111111111111
//
//	printf("%d\n", b);
//	printf("%d\n", a);
//
//
//	system("pause");
//	return 0;
//}
//
//int main()
//{
//	int a = -1;
//	int b = a>>1;
//	printf("%d\n", b);
//	system("pause");
//
//	//>>  右移操作符-二进制位
//	//算术右移
//	//右边丢弃，左边补原符号位
//
//	//逻辑右移
//	//右边丢弃，左边补0
//	//
//	//11111111111111111111111111111111
//	//
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//按（二进制）位与
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001
//	//
//	//按位或
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	//
//	//按位异或
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//	//
//	int c = a ^ b;
//	printf("%d\n", c);
//	system("pause");
//	return 0;
//}
//
//int main()
//{
//	int a = 10;
//	a = a+2;//1
//	a += 2; //2
//	a = a+1;
//	//a++;
//
//	return 0;
//}
//
//int main()
//{
//	int a = 0;
//	//printf("%d\n", !a);
//	if(a)
//		printf("a 是真\n");
//	if(!a)
//		printf("a 是假\n");
//	system("pause");
//	return 0;
//}

int main()
{
	int a = 3;
	a = -a;
	a = -a;
	printf("a = %d\n", a);
	system("pause");
	return 0;
}