#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <string.h>



//
//int main()
//{
//// 	char c = 1;
//// 	printf("%d\n", sizeof(c));//1
//// 	printf("%d\n", sizeof(+c));//4
//// 	printf("%d\n", sizeof(!c));//4
//	char a = 127;
//	char b = 3;
//	char c = a+b;
//
//	//00000000000000000000000001111111
//	//00000000000000000000000000000011
//	//
//	//00000000000000000000000001111111
//	//00000000000000000000000000000011
//	//00000000000000000000000010000010
//	//11111111111111111111111110000010
//	//11111111111111111111111110000001
//	//10000000000000000000000001111110
//	//
//	printf("%d\n", c);//127 -1 -2 
//	return 0;
//}
//

//int main()
//{
//	char a = 0xb6;//10110110
//	//11111111111111111111111110110110
//	//
//	short b = 0xb600;
//	int c = 0xb6000000;
//
//	if(a == 0xb6)
//		printf("a\n");
//	if(b == 0xb600)
//		printf("b\n");
//	if(c == 0xb6000000)
//		printf("c\n");
//	//int a = 10;
//	//int b = 20;
//	//int c = a+b+10;
//
//	return 0;
//}
//
////½á¹¹Ìå
//struct Student
//{
//	char name[20];
//	int age;
//	char id[20];
//};
//
//
////int/float
//int main()
//{
//	int num = 0;
//	struct Student s = {"lisi", 21, "20180202"};
//	struct Student* ps = &s;
//	//printf("%s %d %s\n", (*ps).name, (*ps).age, (*ps).id);
//	printf("%s %d %s\n", ps->name, ps->age, ps->id);
//
//	//s.name = "ÕÅÈý";
//// 	strcpy(s.name, "ÕÅÈý");
//// 	s.age = 20;
//// 	//s.id = "20180101";
//// 	strcpy(s.id, "20180101");
//// 	
//// 	printf("%s %d %s\n", s.name, s.age, s.id);
//	return 0;
//}

// int Add(int x, int y)
// {
// 	return x+y;
// }
// 
// int main()
// {
// 	int a = 10;
// 	int b = 20;
// 	int c = Add(a, b);
// 
// 	return 0;
// }
// int main()
// {
// 	int arr[10] = {0};
// 	arr[5] = 5;
// 	return 0;
// }
// 
// int main()
// {
// 	int a = 10;
// 	int b = 20;
// 
// 	int max = a>b?a:b;
// 
// 	//if(a>5)
// 	//	b = 3;
// 	//else
// 	//	b = -3;
// 
// 	//a>5 ? b=3 : b=-3;//
// 	//b = a>5?3:-3;//ok
// 
// 	return 0;
// }

//#include <stdio.h>
//int main()
//{
//	int i = 0,a=1,b=2,c =3,d=4;
//	//i = a++ && ++b && d++;
//	i = a++||++b||d++;
//	printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);
//	//
//	return 0;
//}


//
//int main()
//{
//	int a = 1;
//	int b = 2;
//	//a|b;//3
//	//a||b;//1
//	//a&b;//0
//	//a&&b;//0
//	/*char *p = "abcdef";
//
//	if("123456" == "122222222")
//	{
//
//	}*/
//	//int a = (int)3.14;
//	//printf("%d\n", a);
//	return 0;
//}
//
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//	return 0;
//}
// int main()
// {
// 	int a = 10;
// 	//int b = ++a;
// 	int b = a++;
// 	printf("a = %d b = %d\n", a, b);
// 	return 0;
// }

//
//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000
//	return 0;
//}


// int main()
// {
// 	int a = 0;
// 	//00000000000000000000000000000
// 	//11111111111111111111111111111
// 	//11111111111111111111111111110
// 	//10000000000000000000000000001
// 	//
// 	printf("%d\n", ~a);//-1
// 	return 0;
// }

//void test(short n)
//{
//	//
//}
//int main()
//{
//	//printf("%d\n", !0);
//	//int a = 10;
//	//printf("%d\n", sizeof a);//4
//	//printf("%d\n", sizeof(int));//4
//	short s = 4;
//	int a = 3;
//	//printf("%d\n", sizeof(s=a+10));//2
//	test(s=a+10);
//	printf("%d\n", s);//4 
//	return 0;
//}
// int  main()
// {
// 	int a = 10;
// 	a = a+1;//1
// 	a += 1; //2
// 	a = a>>1;
// 	a >>= 1;
// 	//
// 	//sizeof(arr)/sizeof(arr[0]);
// 	//
// 	//a++;//3
// 	return 0;
// }

//
//-1
//
//11111111111111111111111111111111
//00000000000000000000000000000001
//
//
//
//
//1234
//
//
// int main()
// {
// 	//int a = 10;
// 	//int b = a<<-3;
// 	//a>>3;
// 	//int a = 2^4;
// 	//010
// 	//100
// 	//110
// 	//
// 	//1
// 	//
// 	printf("%d\n", a);
// 	return 0;
// }

//
//int main()
//{
//	//ÓÒÒÆ²Ù×÷
//	//ËãÊõÓÒÒÆ
//	//×ó±ß²¹Ô­·ûºÅÎ»,ÓÒ±ß¶ªÆú
//	//
//
//	//
//	//Âß¼­ÓÒÒÆ
//	//×ó±ß²¹0,ÓÒ±ß¶ªÆú
//	//
//
//	int a = 10;
//	//00000000000000000000000000000101
//	//
//	//
//	//10000000000000000000000000000001-Ô­Âë
//	//11111111111111111111111111111110-·´Âë
//	//11111111111111111111111111111111-²¹Âë
//	int b = a>>1;
//	printf("%d\n", b);
//
//	//
//	//00000000000000000000000000000110
//	//
//	//int b = a>>1;
//	return 0;
//}
//
//int main()
//{
//	//double c = 10/3.0;//3
//	//printf("%lf\n", c);
//	//int a = 5%2.0;//err
//	//printf("%d\n", a);
//
//	int a = 13;
//	//00000000000000000000000000001101
//	//
//	//int b = a<<1;
//	//a = a<<1;
//
//	printf("%d\n", b);//26
//	printf("%d\n", a);//
//
//	return 0;
//}